# UnableToRestoreAllMembersOfGroups Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..GroupFailures..::..UnableToRestoreAllMembersOfGroups Property
BuiltInFailures..::..GroupFailures Class See Also
---
Revit is unable to restore the members of the selected groups.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId UnableToRestoreAllMembersOfGroups { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property UnableToRestoreAllMembersOfGroups As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ UnableToRestoreAllMembersOfGroups {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..GroupFailures Class
Autodesk.Revit.DB Namespace